# DatumBubbleEndn1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DatumBubbleEndn1 Property
ParameterTypeId Class See Also
---
"Symbol at End 1 Default"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DatumBubbleEndn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DatumBubbleEndn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DatumBubbleEndn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace